foampilot/examples/openfoam13/vof_to_dpm/example/sprayCrossFlow/Allrun
#!/bin/sh

caseDir=$(CDPATH= cd -- "$(dirname -- "$0")" && pwd)
workDir=${TMPDIR:-/tmp}/foampilot-sprayCrossFlow-$$
trap 'status=$?; if [ "$status" -eq 0 ] && [ "${KEEP_CASE:-0}" -ne 1 ]; then rm -rf "$workDir"; else echo "CASE_DIR=$workDir" >&2; fi; exit "$status"' EXIT

. /opt/openfoam13/etc/bashrc || true
set -e
mkdir -p "$workDir"
cd "$workDir"

# The complete OpenFOAM 13 case is versioned with this foampilot example.
# No tutorial merge or external reference checkout is required at runtime.
cp -R "$caseDir/0/." 0/
cp -R "$caseDir/system/." system/
cp -R "$caseDir/constant/." constant/

blockMesh > log.blockMesh 2>&1
snappyHexMesh -overwrite > log.snappyHexMesh 2>&1
foamRun -solver incompressibleVoF > log.foamRun 2>&1
python3 "$caseDir/postprocess.py" "$workDir" "$workDir/postProcessing" > postprocess.log 2>&1

grep -q 'Selecting solver incompressibleVoF' log.foamRun
grep -q 'Selecting finite volume model type incompressibleVoFClouds' log.foamRun
grep -q 'Selecting parcelCloud collidingCloud' log.foamRun
grep -q 'VOF fragments detected: 1' log.foamRun
grep -q '^End$' log.foamRun
! grep -q 'FOAM FATAL' log.foamRun
grep -q '"conversion_mass_balance_pass": true' postprocess.log
grep -q '"solver_end_pass": true' postprocess.log

echo 'PASS: sprayCrossFlow VOF-to-DPM OpenFOAM 13 + postprocess'
